---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInheritTypeWarn
source: html/d08704f4-74fc-9495-d2f6-f48956ea384d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInheritTypeWarn Property

Edits to these assemblies do not match existing types, new type will be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyInheritTypeWarn { get; }
```